000100*This is a comment
000200*
000300 IDENTIFICATION DIVISION.
000400  PROGRAM-ID. cobol_main.
000500  AUTHOR. Me.
000600  DATE-WRITTEN. 01/01/2025
000700  DATE-COMPILED. 01/01/2025
000800  REMARKS. 'This program is a demonstraion of hello world'.
000900*
001000 ENVIRONMENT DIVISION.
001100  CONFIGURATION SECTION.
001200*  The computer that the source code was written in.
001300   SOURCE-COMPUTER. Linux.
001400*  The computer that the code compiles for.
001500   OBJECT-COMPUTER. Linux.
001600  INPUT-OUTPUT SECTION.
001700   FILE-CONTROL.
001800   I-O-CONTROL.
001900*
002000 DATA DIVISION.
002100  FILE SECTION.
002200  WORKING-STORAGE SECTION.
002300*
002400  LINKAGE SECTION.
002500* "REPORT" and "SCREEN" sections not available with IBM COBOL x86.
002600  REPORT SECTION.
002700  SCREEN SECTION.
002800*
002900 PROCEDURE DIVISION.
003000     DISPLAY 'Hello world.'.
003100     DISPLAY 'I will win.'.
