000100*This is a comment
000200*
000300 IDENTIFICATION DIVISION.
000400  PROGRAM-ID. printSentence.
000500  AUTHOR. Me.

002900 PROCEDURE DIVISION.
003100     DISPLAY 'I will win.'.